{"tasks": ["Implement a rasterizer for rendering 2D shapes.", "Write a function to draw a filled triangle using the scanline algorithm.", "Create an algorithm to generate a simple 2D maze and render it using lines.", "Implement a Point-in-Polygon test using ray-casting.", "Write a program to simulate basic physics with particles and springs.", "Create a simple ray tracer that supports spheres and planes.", "Design a texture mapping algorithm for a 3D object.", "Implement shadow mapping to add shadows to a 3D scene.", "Write a program to render a Bézier curve given control points.", "Create a simple particle system to simulate fire or smoke.", "Implement the Bresenham line drawing algorithm.", "Write a function to compute the convex hull of a set of 2D points.", "Implement Phong shading for a 3D object.", "Create a program to compute and display the Mandelbrot set.", "Design a motion blur effect for an animated 3D object.", "Implement Gouraud shading in a 3D rendering engine.", "Write a program to create a heightmap and render a 3D terrain.", "Implement a collision detection routine for 2D shapes.", "Create a function to compute the intersections of lines in 2D.", "Write a shader to create a water effect on a 3D surface.", "Implement an edge detection algorithm for images.", "Write a program to draw a circle using midpoint circle algorithm.", "Create a simple lighting model for a 3D scene with directional light.", "Implement 3D transformations using matrices (translation, rotation, scaling).", "Write a program to generate procedural noise (e.g., Perlin noise).", "Implement an algorithm to project 3D coordinates onto a 2D plane.", "Create a simple game using OpenGL or DirectX.", "Write a program to ray trace a reflective surface.", "Implement anti-aliasing in a 2D or 3D renderer.", "Create a simple fractal generator (e.g., Julia set).", "Implement ambient occlusion to improve rendering realism.", "Write a program to simulate cloth physics using a particle system.", "Implement a camera system for navigating a 3D environment.", "Create a vertex shader to transform points in a 3D graphics pipeline.", "Write a program to extrude a 2D shape into a 3D object.", "Implement silhouette edge detection for a 3D model.", "Create a simple graphics editor that supports drawing basic shapes.", "Write a program to generate a 3D model from a heightmap.", "Implement ambient light in a 3D graphics engine.", "Create a simple keyframe animation system for 3D models.", "Write a program to simulate light scattering in a foggy scene.", "Implement a kd-tree for efficient ray tracing of 3D scenes.", "Create a function to render 3D text in a graphics application.", "Write a program to create a wireframe model viewer.", "Implement a simple lens flare effect for a virtual camera.", "Create a shader to simulate glass material properties in 3D.", "Write a program to display a spline given control points.", "Implement bilinear filtering on textures in a 3D renderer.", "Write a program to create procedural plant models using L-systems.", "Implement cascade shadow maps for large outdoor scenes.", "Create a real-time 2D fluid simulation.", "Write a function to generate quaternions from Euler angles for rotations.", "Implement a system to manage multiple light sources in a 3D engine.", "Create a simple 3D platformer using physics-based movement.", "Write a shader for a bump-mapped surface.", "Implement a flood fill algorithm for coloring connected regions.", "Create a program to render a field of stars in a galactic environment.", "Write a real-time 2D physics engine with collision response.", "Implement parallax mapping for enhanced surface detail.", "Create a panoramic image viewer to navigate a 360-degree scene.", "Write a program to perform subsurface scattering for realistic skin.", "Implement tessellation of 3D surfaces for higher detail.", "Create a shader to perform chromatic aberration post-processing effect.", "Write a program to convert a 3D model into a voxel representation.", "Implement simple 2D sprite animation with frames and timing.", "Create a shader to simulate a heat haze distortion effect.", "Write a program to simulate a bouncing ball with accurate physics.", "Implement a seamless texture generator from an image sample.", "Create a function to perform line-of-sight calculations in a grid.", "Write a shader to create cel-shaded or toon-shaded effects.", "Implement an algorithm to merge overlapping polygons into one.", "Create a program to simulate a ripple effect on water.", "Write a function to compute the normal map from a heightmap.", "Implement a system to load and display animated 3D models.", "Create an interactive tool to design 2D levels or maps.", "Write a function to perform catmull-rom spline interpolation in 2D.", "Implement a Marching Cubes algorithm for isosurface extraction.", "Create a program to render a scene with depth of field effect.", "Write a function to perform color keying for removing backgrounds.", "Implement a function to generate 3D models from contour lines.", "Create a shader for simulating velvet or soft fabric materials.", "Write a program that visualizes a mathematical function in 3D.", "Implement a real-time face tracking application using a webcam.", "Create a tool for visualizing vector fields in 2D or 3D.", "Write a program to simulate rain with particle systems.", "Implement a voxel-based terrain engine with level of detail.", "Create a function to perform CSG (Constructive Solid Geometry) operations.", "Write a shader to create a 3D hologram effect.", "Implement a virtual trackball for 3D model manipulation.", "Create a real-time traffic simulation with cars and roads.", "Write a program to animate based on physics such as pendulums.", "Implement a program that generates and renders point clouds from 3D data.", "Create an interactive tangent vector visualization tool for curves.", "Write code to simulate realistic ragdoll physics for dynamic models.", "Implement a post-processing effect to simulate night vision.", "Create a fully-parametric model of a tree with growth simulation.", "Write a function to compute silhouette shadows for 2D sprites.", "Implement a lightmap baking process for static 3D scenes.", "Create a program to make use of the FFT for image processing applications.", "Write a shader for an iridescent material effect in 3D.", "Implement a tool to measure the brightness distribution of an image.", "Create an interactive 3D solar system simulation showing planets orbits.", "Write a program to export scenes as HDR images for visual effects.", "Implement a CUDA based rasterization process for accelerated rendering.", "Create a 2D cellular automaton visualization, such as Conway's Game of Life.", "Write a program to process and visualize atmospheric scattering.", "Implement adaptive volumetric fog for dense environmental effects.", "Create a simple ray marching effect for rendering distance fields.", "Write a program to decrypt and visualize digital holograms.", "Implement a simple multi-core parallel renderer to boost rendering times.", "Create graphics filters that apply artistic effects like watercolor or oil painting.", "Write a viewer that supports polygons with holes and nested structures.", "Implement a rigid body physics engine with constraints and joints.", "Create a 3D gardening simulation where plants grow based on light and water.", "Write a shader to simulate sandy surfaces with anisotropic shading.", "Implement a method to reconstruct 3D scenes from a series of 2D images.", "Create a program to demonstrate color blindness simulations on digital screens.", "Write a program to identify prominent contours in an image using edges.", "Implement dynamic resolution scaling to maintain performance under load.", "Create an interactive volumetric particle system for fireflies.", "Write software to convert 3D scenes into detailed line art renderings.", "Implement a meta-ball surface rendering using implicit surface equations.", "Create a terrain sculpting tool with paint-like brushes for editing heightmaps.", "Write a physics-based simulator for the jiggling of soft bodies.", "Implement a shader to create caustic effects on underwater surfaces.", "Create a virtual environment for manipulating cloth using verlet integration.", "Write an image processing tool to automatically correct red-eye in photos.", "Implement a function to generate seamless transition between animations.", "Create a particle flow visualization tool for wind or heat in 3D.", "Write a program to simulate the spread of lava with cellular flow dynamics.", "Implement a data-driven approach to smoothly blend human facial expressions.", "Create a constraint-based system for solving IK in 3D character rigs.", "Write algorithms to efficiently encode and decompress 3D volume data.", "Implement a method to generate bump maps directly from photographic textures.", "Create a GPU-based simulator for high detail water and foam dynamics.", "Write a program to create a hybrid ray-marching and rasterization pipeline."], "length": 200}